// Ломакина <<Настройка видимости добавленных в основную конфигурацию 
//			реквизитов в зависимости от выбора типа договора

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоздатьПоляНаФорме();
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		НастроитьВидимостьНовыхРеквизитов(Истина);
	Иначе
		НастроитьВидимостьНовыхРеквизитов(Ложь);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		НастроитьВидимостьНовыхРеквизитов(Истина);
	Иначе
		НастроитьВидимостьНовыхРеквизитов(Ложь);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьВидимостьНовыхРеквизитов(Видимость)
	
	Элементы.ВКМ_ДатаНачалаДействия.Видимость = Видимость;
	Элементы.ВКМ_ДатаОкончанияДействия.Видимость = Видимость;	
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Видимость;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Видимость;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПоляНаФорме()
	
	ИменаНовыхЭлементов = Новый Массив;
	ИменаНовыхЭлементов.Добавить("ВКМ_ДатаНачалаДействия");
	ИменаНовыхЭлементов.Добавить("ВКМ_ДатаОкончанияДействия");
	ИменаНовыхЭлементов.Добавить("ВКМ_СуммаАбонентскойПлаты");
	ИменаНовыхЭлементов.Добавить("ВКМ_СтоимостьЧасаРаботы");
	
	ДобавитьПолеВвода(ИменаНовыхЭлементов);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеВвода(ИменаНовыхЭлементов)

	Для Каждого ИмяНовогоЭлемента Из ИменаНовыхЭлементов Цикл
	
		НовыйЭлемент = Элементы.Добавить(ИмяНовогоЭлемента, Тип("ПолеФормы"), );
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = СтрШаблон("Объект.%1", ИмяНовогоЭлемента);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти