// Ломакина <<Настройка видимости добавленных в основную конфигурацию 
//			реквизитов в зависимости от выбора типа договора

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		НастроитьВидимостьНовыхРеквизитов(Истина);
	Иначе
		НастроитьВидимостьНовыхРеквизитов(Ложь);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		НастроитьВидимостьНовыхРеквизитов(Истина);
	Иначе
		НастроитьВидимостьНовыхРеквизитов(Ложь);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере

Процедура НастроитьВидимостьНовыхРеквизитов(Видимость)
	
	Элементы.ВКМ_ДатаНачалаДействия.Видимость = Видимость;
	Элементы.ВКМ_ДатаОкончанияДействия.Видимость = Видимость;	
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Видимость;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Видимость;
	
КонецПроцедуры

#КонецОбласти