#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_ЗаполнитьГрафик(Команда)
	
	ВыполнитьОбработку();
	
	ГрафикРаботы = ПолучитьГрафик();
	ОчиститьСообщения();
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон("%1 график заполнен на период с %2 по %3.",
								ГрафикРаботы,
								Формат(ВКМ_Период.ДатаНачала, "ДФ=dd.MM.yyyy;"),
								Формат(ВКМ_Период.ДатаОкончания, "ДФ=dd.MM.yyyy;"));
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбработку()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВКМ_ЗаполнитьГрафик(ВКМ_Период.ДатаНачала, ВКМ_Период.ДатаОкончания, ВКМ_ВыходныеДни);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	
	НаборЗаписей = РегистрыСведений. ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();

КонецПроцедуры

&НаСервере
Функция ПолучитьГрафик()
	Возврат Объект.ВКМ_ГрафикРаботы; 
КонецФункции
#КонецОбласти